reddit_clone/app/views/posts/edit.html.erb

SELECT "subs".* FROM "subs"
---
  <label > Content: <textarea name="post[content]"><%=@post.content%></textarea></label>
<% Sub.all.each do |sub| %>