reddit_clone/app/views/posts/new.html.erb

SELECT "subs".* FROM "subs"
---
  <label > Content: <textarea name="post[content]"></textarea></label>
<% Sub.all.each do |sub| %>