reddit_clone/app/models/post.rb

  def sub_ids=(sub_ids)
    self.post_subs.each do |post_sub|
      post_sub.destroy
    end
    sub_ids.map(&:to_i).each do |sub_id|
      p = PostSub.new(post_id: self.id, sub_id: sub_id)
      p.save
---
SELECT "post_subs".* FROM "post_subs" WHERE "post_subs"."post_id" = $1  [["post_id", 12]]
DELETE FROM "post_subs" WHERE "post_subs"."id" = $1  [["id", 5]]
INSERT INTO "post_subs" ("post_id", "sub_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 14], ["sub_id", 1], ["created_at", "2019-02-06 00:18:45.500499"], ["updated_at", "2019-02-06 00:18:45.500499"]]