reddit_clone/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "acasdasdas"], ["author_id", 1], ["post_id", 16], ["created_at", "2019-02-06 01:23:43.365710"], ["updated_at", "2019-02-06 01:23:43.365710"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.author_id = current_user.id
    @comment.post_id = params[:post_id]

    if @comment.save!