reddit_clone/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    @post.sub_id = params[:sub_id]

    sub_ids = post_params[:sub_ids]

    sub_ids.each do |sub_id|
      PostSub.new(post_id: @post.id, sub_id: sub_id)
    end


    if @post.save
---
INSERT INTO "post_subs" ("post_id", "sub_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 12], ["sub_id", 1], ["created_at", "2019-02-06 00:16:16.076597"], ["updated_at", "2019-02-06 00:16:16.076597"]]