reddit_clone/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "cool"], ["url", "cool.com"], ["content", "cool"], ["author_id", 1], ["created_at", "2019-02-05 23:36:45.036627"], ["updated_at", "2019-02-05 23:36:45.036627"]]
---
  def create
    # debugger
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    if @post.save!

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT "subs".* FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 14]]
---
  def edit
    @post = Post.find(params[:id])
    @sub_ids = @post.subs.map{|sub| sub.id}

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def destroy
    @post = Post.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
  def require_author
    post = Post.find(params[:id])